{
  "main.title": "Please connect to NodeCore",
  "message.text.1a": "Please first connect to NodeCore.",
  "message.text.3a": "You can change the IP and Port in the properties file.",
  "message.forumlink.display.4": "VeriBlock Discord",
  "label.lblConnectToNC": "Please first connect to NodeCore. This could be a local or remote instance.",
  "label.lblPropFile": "Make sure the address, port, and (optional) password in the properties file are correct:",
  "label.lblMessageCommunity": "For further questions, join the community at:",
  "label.lnkForum": "VeriBlock Discord",
  "label.lblbtnNodeCoreStart": "I already have NodeCore on this machine and want to start it",
  "label.lblbtnNodeCoreInstall": "I do not yet have NodeCore and want to open a webpage with install instructions",
  "label.lblbtnNodeCoreReconnect": "NodeCore is already running, I changed a connection property and want to try reconnecting",
  "label.minNCVersion": "This requires at least NodeCore version %1$s or higher.",
  "btnNodeCoreStart.text": "Start NodeCore",
  "btnNodeCoreInstall.text": "Install NodeCore",
  "btnNodeCoreReconnect.text": "Reconnect to NodeCore",
  "onloadErrorPassword": "Missing or Invalid Password. Please modify the properties file (%1$s) and add a new key for the password to match what is in the nodecore.properties file: %2$s, and click the \u0027Reconnect to NodeCore\u0027 button.",
  "onloadErrorUnavailable": "NodeCore not available at %1$s. Please either start NodeCore or modify the properties file (%2$s) and click the \u0027Reconnect to NodeCore\u0027 button.",
  "tryConnectSuccess": "Connected to NodeCore!",
  "tryConnectRetry": "Attempt to reconnect",
  "startAreYouSure": "Are you sure that you want to start a new instance of NodeCore (there should be only one instance running).\nIf NodeCore is already started then don\u0027t start a second instance.",
  "startAreYouSure_cancel": "Action cancelled - new instance of NodeCore not started",
  "startPickFolder": "Pick the \u0027bin\u0027 folder containing NodeCore startup scripts (like nodecore or nodecore.bat)",
  "startNoFolder": "No folder selected, did not start NodeCore",
  "startSuccess": "Successfully started NodeCore as a new process. Running from: %1$s.\nPlease note that NodeCore may take several minutes to load before you can connect to it!",
  "installSuccess": "Opened webpage with install steps: %1$s"
}